soap_test/generated/Service.hello.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns1="http://tempuri.org/ns.xsd/Service.wsdl"
    xmlns:ns2="http://tempuri.org/ns.xsd">
 <SOAP-ENV:Body>
   <ns2:hello>
    <name></name>
   </ns2:hello>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
